In [8]:
import pandas as pd
import numpy as np

In [9]:
string_data = pd.Series(['aardvark','artichoke', np.nan, 'avocado'])

In [10]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [11]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [12]:
string_data[0]

'aardvark'

In [13]:
string_data[0] = None

In [14]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [15]:
#Filling out missing data

In [16]:
from numpy import nan as NA

In [17]:
data = pd.Series([1,NA,3.5,NA,7])

In [18]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [19]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [22]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA,],[NA,6.5,3.]])

In [23]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
cleaned = data.dropna()

In [25]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [26]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df = pd.DataFrame(np.random.rand(7,3))

In [29]:
df

          0         1         2
0  0.447955  0.211659  0.340267
1  0.125769  0.469982  0.200186
2  0.588671  0.964818  0.609725
3  0.758991  0.679212  0.393799
4  0.689565  0.511964  0.064372
5  0.909534  0.908906  0.731498
6  0.855447  0.953091  0.827172

In [30]:
df.iloc[:4,1]= NA

In [31]:
df

          0         1         2
0  0.447955       NaN  0.340267
1  0.125769       NaN  0.200186
2  0.588671       NaN  0.609725
3  0.758991       NaN  0.393799
4  0.689565  0.511964  0.064372
5  0.909534  0.908906  0.731498
6  0.855447  0.953091  0.827172

In [33]:
df.iloc[:2,2] = NA

In [34]:
df

          0         1         2
0  0.447955       NaN       NaN
1  0.125769       NaN       NaN
2  0.588671       NaN  0.609725
3  0.758991       NaN  0.393799
4  0.689565  0.511964  0.064372
5  0.909534  0.908906  0.731498
6  0.855447  0.953091  0.827172

In [35]:
df.dropna()

          0         1         2
4  0.689565  0.511964  0.064372
5  0.909534  0.908906  0.731498
6  0.855447  0.953091  0.827172

In [36]:
#Filling In Missing Data

In [37]:
df.fillna(0)

          0         1         2
0  0.447955  0.000000  0.000000
1  0.125769  0.000000  0.000000
2  0.588671  0.000000  0.609725
3  0.758991  0.000000  0.393799
4  0.689565  0.511964  0.064372
5  0.909534  0.908906  0.731498
6  0.855447  0.953091  0.827172

In [38]:
df

          0         1         2
0  0.447955       NaN       NaN
1  0.125769       NaN       NaN
2  0.588671       NaN  0.609725
3  0.758991       NaN  0.393799
4  0.689565  0.511964  0.064372
5  0.909534  0.908906  0.731498
6  0.855447  0.953091  0.827172

In [40]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0  0.447955  0.500000  0.000000
1  0.125769  0.500000  0.000000
2  0.588671  0.500000  0.609725
3  0.758991  0.500000  0.393799
4  0.689565  0.511964  0.064372
5  0.909534  0.908906  0.731498
6  0.855447  0.953091  0.827172

In [42]:
df.fillna(0, inplace= True)

In [43]:
df

          0         1         2
0  0.447955  0.000000  0.000000
1  0.125769  0.000000  0.000000
2  0.588671  0.000000  0.609725
3  0.758991  0.000000  0.393799
4  0.689565  0.511964  0.064372
5  0.909534  0.908906  0.731498
6  0.855447  0.953091  0.827172

In [44]:
df = pd.DataFrame(np.random.randn(6,3))

In [45]:
df

          0         1         2
0  1.071541 -1.794413  0.941146
1 -0.018917 -0.712938 -0.261557
2  1.760163  1.859811 -0.604682
3 -0.375680  0.702099  0.222403
4  0.543456 -0.519811  0.000205
5 -1.060311  1.396143 -0.346515

In [46]:
df.iloc[2:,1] = NA

In [48]:
df.iloc[4:,2] = NA

In [49]:
df

          0         1         2
0  1.071541 -1.794413  0.941146
1 -0.018917 -0.712938 -0.261557
2  1.760163       NaN -0.604682
3 -0.375680       NaN  0.222403
4  0.543456       NaN       NaN
5 -1.060311       NaN       NaN

In [53]:
df.fillna(method='ffill')

          0         1         2
0  1.071541 -1.794413  0.941146
1 -0.018917 -0.712938 -0.261557
2  1.760163 -0.712938 -0.604682
3 -0.375680 -0.712938  0.222403
4  0.543456 -0.712938  0.222403
5 -1.060311 -0.712938  0.222403

In [54]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.071541 -1.794413  0.941146
1 -0.018917 -0.712938 -0.261557
2  1.760163 -0.712938 -0.604682
3 -0.375680 -0.712938  0.222403
4  0.543456       NaN  0.222403
5 -1.060311       NaN  0.222403

In [55]:
data = pd.Series([1.,NA,3.5,NA,7])

In [56]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [57]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [58]:
#Data Transformation

In [59]:
#- Removing Duplicates

In [78]:
data = pd.DataFrame({'k1':['one','two']* 3 + ['two'],
'k2':[1,1,2,3,3,4,4]})

In [79]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [80]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [81]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [82]:
data['v1'] = range(7)

In [83]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [84]:
data.drop_duplicates({'k1'})

    k1  k2  v1
0  one   1   0
1  two   1   1

In [85]:
# Transforming Data Using a Function or Mapping

In [86]:
data = pd.DataFrame({'food': ['bacon','pull pork', 'bacon','Pastrami', 'corned beef','Bacon','pastrami','honey ham','nova lox'],
'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [87]:
data

          food  ounces
0        bacon     4.0
1    pull pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [88]:
meat_to_animal = {
    'bacon':'pig',
    'pull pork': 'pig',
    'pastrami':'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'}

In [90]:
lowercased = data['food'].str.lower()

In [91]:
lowercased

0          bacon
1      pull pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [92]:
data['animal'] = lowercased.map(meat_to_animal)

In [93]:
data

          food  ounces  animal
0        bacon     4.0     pig
1    pull pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [95]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [96]:
# Replacing Values

In [97]:
data = pd.Series([1.,-999,2.,-999,-1000,3.])

In [98]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [99]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [100]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [101]:
data.replace([-999,-1000],[99,100])

0      1.0
1     99.0
2      2.0
3     99.0
4    100.0
5      3.0
dtype: float64

In [102]:
# Renaming Axis Indexes

In [103]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
index=['Ohio','Colorado','New York'],
columns=['one','two','three','four'])

In [104]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [113]:
transform = lambda x: x[:4].upper()

In [106]:
transform

In [111]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [112]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [110]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [117]:
data.rename(index={'Ohio': 'INDIANA','Colorado':'COLO','New York': 'NY'},
columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NY         8    9        10    11

In [118]:
# Discretization and Binning

In [119]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [120]:
bins = [18,25,35,60,100]

In [121]:
cats = pd.cut(ages,bins)

In [122]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [123]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [124]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [125]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [126]:
pd.cut(ages, [18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [127]:
group_names = ['Youth','YoungAdult','MiddleAges','Senior']

In [128]:
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAges', 'MiddleAges', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAges' < 'Senior']

In [129]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [130]:
bins

[18, 25, 35, 60, 100]

In [131]:
group_names

['Youth', 'YoungAdult', 'MiddleAges', 'Senior']

In [132]:
data = np.random.rand(20)

In [133]:
pd.cut(data,4,precision=2)

[(0.75, 0.99], (0.52, 0.75], (0.051, 0.29], (0.75, 0.99], (0.52, 0.75], ..., (0.29, 0.52], (0.29, 0.52], (0.75, 0.99], (0.75, 0.99], (0.75, 0.99]]
Length: 20
Categories (4, interval[float64]): [(0.051, 0.29] < (0.29, 0.52] < (0.52, 0.75] < (0.75, 0.99]]

In [134]:
# Detecting and Filtering Outliers

In [135]:
data = pd.DataFrame(np.random.randn(1000,4))

In [136]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.048453    -0.002033     0.016179     0.020000
std       0.980932     0.990731     1.030712     1.006613
min      -2.852551    -2.995752    -3.838287    -2.849452
25%      -0.571641    -0.662613    -0.696378    -0.670228
50%       0.096418    -0.005856     0.004865     0.003060
75%       0.686746     0.702298     0.715207     0.736305
max       3.366045     3.035695     3.350790     3.250857

In [137]:
col = data[2]

In [138]:
col[np.abs(col) > 3]

253   -3.216074
527   -3.838287
692    3.350790
845    3.181088
987    3.055832
Name: 2, dtype: float64

In [139]:
data[(np.abs(data)> 3).any(1)]

            0         1         2         3
253 -0.672274  1.127384 -3.216074 -0.365597
349  2.268539 -0.754816  0.546159  3.250857
527  0.147728 -0.430849 -3.838287  0.693921
692 -0.639159 -0.539882  3.350790  1.226771
719  3.366045  0.076679  0.454700  0.658027
842  0.120173  3.035695 -1.763030 -0.465635
845  0.323260  0.686385  3.181088 -1.494800
875  0.230757 -1.239369  0.115421  3.086025
987  0.077025 -1.240082  3.055832  0.254369

In [140]:
# Computing Indicator/ Dummy Variables

In [141]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
'data1': range(6)})

In [142]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [143]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [144]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [145]:
df_with_dummy = df[['data1']].join(dummies)

In [146]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [147]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [150]:
import pandas as pd

In [169]:
mnames = ['movie_id','title','genres']

In [190]:
movies = pd.read_csv("movies.csv")

In [191]:
movies

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [192]:
movies[:10]

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [193]:
all_genres = []

In [194]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [195]:
genres = pd.unique(all_genres)

In [196]:
genres

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

In [197]:
## Construct the indicator DataFrame, start with a DFrame of all zeros

In [198]:
zero_matrix = np.zeros((len(movies),len(genres)))

In [199]:
dummies = pd.DataFrame(zero_matrix,columns=genres)

In [200]:
gen = movies.genres[0]

In [201]:
gen.split('|')

['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy']

In [203]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2, 3, 4], dtype=int64)

In [204]:
# USE iloc to set values based on the indices

In [205]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [206]:
movies

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [207]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [209]:
movies_windic.iloc[0]

movieId                                                               1
title                                                  Toy Story (1995)
genres                      Adventure|Animation|Children|Comedy|Fantasy
Genre_Adventure                                                       1
Genre_Animation                                                       1
Genre_Children                                                        1
Genre_Comedy                                                          1
Genre_Fantasy                                                         1
Genre_Romance                                                         0
Genre_Drama                                                           0
Genre_Action                                                          0
Genre_Crime                                                           0
Genre_Thriller                                                        0
Genre_Horror                                                          0
Genre_Mystery                                                         0
Genre_Sci-Fi                                                          0
Genre_War                                                             0
Genre_Musical                                                         0
Genre_Documentary                                                     0
Genre_IMAX                                                            0
Genre_Western                                                         0
Genre_Film-Noir                                                       0
Genre_(no genres listed)                                              0
Name: 0, dtype: object

In [210]:
# String Manipulation

In [211]:
#- String Object Method

In [220]:
val = 'a,b,guido'
val.split(',')

['a', 'b', 'guido']

In [221]:
pieces = [x.strip() for x in val.split(',')]

In [222]:
pieces

['a', 'b', 'guido']

In [223]:
first, second, third = pieces

In [224]:
first + '::' + second + '::' + third

'a::b::guido'

In [225]:
pieces

['a', 'b', 'guido']

In [227]:
'guido' in val

True

In [228]:
val.index(',')

1

In [229]:
val.find(':')

-1

In [230]:
val.count(',')

2

In [231]:
val.replace(',','::')

'a::b::guido'

In [235]:
val.replace(',',  ' ')

'a b guido'

In [236]:
# Regular Expresions

In [237]:
import re

In [238]:
text = "foo   bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [239]:
regex = re.compile('\s+')

In [240]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [241]:
regex.findall(text)

['   ', '\t ', '  \t']

In [242]:
# Vectorized String Functions in Pandas

In [243]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com','Wes':np.nan}

In [244]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [245]:
data = pd.Series(data)

In [246]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [247]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [251]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-])+\.([A-Z]{2,4})'

In [252]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave      [(dave, e, com)]
Steve    [(steve, l, com)]
Rob        [(rob, l, com)]
Wes                    NaN
dtype: object